# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

# Решение:
# n = int(input('Введите количество монет: '))
# orel = 0
# reshka = 0
# for i in range(n):
#     x = int(input('Орел(1) или решка(0)?'))
#     if x == 0:
#         orel += 1
# else:
#     reshka += 1
# if orel > reshka:
#     print(f'Переверните {orel} монет(ы) с орла на решку, их меньше всего')
# elif orel == reshka:
#     print(f'Количество орлов и решек одинаково, по {orel} штук')
# else:
#     print((f'Переверните {reshka} монет(ы) с решки на орла, их меньше всего'))


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

# Решение:
# x = int(input('Задай сумму двух чисел: '))
# y = int(input('Задай произведение чисел: '))
# for i in range(x):
#     for j in range(y):
#         if x == i + j and y == i * j:
#             print(f'первое число ="{i}", второе число ="{j}"')


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

# Решение:
# n = int(input('Введи число N: '))
# i = 0
# while 2 ** i <= n:
#     print(f' 2 в степени {i} равна {2 ** i}')
#     i += 1
 